# VimNote
1.num<C-a> :第一个遇到的数字加num 
  num<C-x> :第一个遇到的数字减num 

2.:so vimrcfullPath  :重新加载vimrc当前打设置
3.vim 中ctrl+s后，vim卡死，是因为ctrl+s是linux中的锁屏快捷键，再按ctrl+q退出锁屏幕
4.vim再插入模式下，退格键不能用：
	再vimrc中添加
	set backspace=indent,eol,start
5.Ctrl+r:r寄存器的用法
		再插入模式下，ctrl+r 插入寄存器中的内容
		其中=寄存器，有计算功能
		eg.:let i=0
		   :let i+=1
		   则=寄存器中的值是 1 
6.Ctrl+o:
	在插入模式，可以进行一次命令，再进入插入模式
	在普通模式，返回上一次修改的地方（：jumps 查看跳转列表）
7.Ctrl+^:快速切换文件 其中，文件的%表示当前文件，#表示可以跳转打文件
8.宏相关
	录制到了寄存器中，所以，想要查看宏的内容，可以输入寄存器中的内容 ：put a
	录制打时候，在宏后面添加命令，使用 qA (寄存器的大写)
	从文件中读取宏，就是把宏读取某个寄存器 但是，要注意行末尾的J.所以，用 0"ay$ dd将宏读取a寄存器，并且删除
9.:args :查看所有打开文件，并且[]中显示的是当前的文件
  :argdo :每个打开文件执行命令
  ？如何让每个文件都不保存的关闭？？
10.:edit! 表示文件不使用缓存中内容，而是重新加载磁盘中的内容
11.大小写转换方式：
	~ 使得光标下的字符大小写互换
	gu 使得选中字符小写
	gU 使得选中字符大写
	vgu 用v选中，再执行命令。
12.在vim中，按了ctrl+z，会使得vim暂时挂起，进入到命令行模式。在命令行中执行 fg 命令，返回上次编辑的地方
	？还有一种方法？？哪种来着？？
13.:fg 返回上一次的文件
14.vim中 . 表示当前位置， %表示当前文件
	vim中的地址，是num
15.在vim命令行中，!{command}表示执行外部命令
16. vim . 表示打开当目录结构（.表示当前位置）
	在vim中:path可以设置当前目录？？？忘了，，， :h path查一下
17.寄存器相关：
	命令模式中，:reg a 表示查看a寄存器中的内容
	普通模式中，"a 表示a寄存器中。查找打时候，是:h queat_a
